TESKAn/kontroler_V4/src/MC56F84763/peripheral/spi.h
/*******************************************************************************
*
* Freescale Semiconductor Inc.
* (c) Copyright 2004-2010 Freescale Semiconductor, Inc.
* ALL RIGHTS RESERVED.
*
********************************************************************************
*
* File Name:  spi.h
*
* $Date:      May-29-2013$
*
* $Version:   2.5.38.0$
*
* Description: Header file for the SPI driver.
*
* This file supports different hardware versions of the module. A version
* of module used in your project is defined in the "arch.h" processor 
* architecture definition file.
*
*  SPI_VERSION_1 .. 56F83xx and 56F801x devices, see MC56F8300UM.pdf, MC56F8000RM.pdf
*  SPI_VERSION_2 .. 56F802x/3x devices, see MC56F802x3xRM.pdf
*  SPI_VERSION_3 .. 56F800x devices, see MC56F800xRM.pdf
*  SPI_VERSION_4 .. 56F824x5x devices, see MC56F824x5xRM.pdf
*
*******************************************************************************/

#ifndef __SPI_H
#define __SPI_H

/* qs.h is a master header file, which must be included */
#if !defined(__ARCH_H) || !defined(__PERIPH_H) || !defined(__APPCONFIG_H)
#error Please include qs.h before spi.h
#endif

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************
* SPI module identifiers, correspond to module base address
*************************************************************/

#ifdef SPI0_BASE
#define SPI_0 (&ArchIO.Spi0)
#endif

#ifdef SPI1_BASE
#define SPI_1 (&ArchIO.Spi1)
#endif

#ifdef SPI2_BASE
#define SPI_2 (&ArchIO.Spi2)
#endif

/* single ("anonymous") module on some devices */
#ifdef SPI_BASE
#define SPI     (&ArchIO.Spi)
#define SPI_0   (&ArchIO.Spi) /* aliased to SPI_0 */
#endif

/*************************************************************
* arch.h should define device-specific information about SPI
**************************************************************/

#if !defined(SPI_VERSION)
#error SPI not properly described in arch.h (old Quick_Start version?)
#endif

/******************************************************************************
*
*                      General Interface Description
*
*
* The Serial Peripheral Interface (SPI) module allows full-duplex, synchronous,
* serial communication between the MC and peripheral devices, including other MCs.
* Software can poll SPI status flags, or SPI operation can be interrupt
* driven. This block contains four 16-bit memory mapped registers for control
* parameters, status, and data transfer.
* 
* Features of the SPI module include:
*   • Full-duplex operation
*   • Master and slave modes
*   • Double-buffered operation with separate transmit and receive registers
*   • Programmable length transmissions (2 to 16 bits)
*   • Programmable transmit and receive shift order (MSB first or last bit transmitted)
*   • Eight master mode frequencies (maximum = bus frequency ÷ 2)
*   • Maximum slave mode frequency = bus frequency ÷ 2
*   • Clock ground for reduced Radio Frequency (RF) interference
*   • Serial clock with programmable polarity and phase
*   • Two separately enabled interrupts
*      — SPI Receiver Full (SPRF)
*      — SPI Transmitter Empty (SPTE)
*   • Mode fault error flag interrupt capability
*   • Wired OR mode functionality enabling connection to multiple SPIs
*
* For more information, please refer to the user manual for the particular
* chip that you are using, such as the MC56F8300 Peripheral Manual,
* for a description of the SPI device.
*
* The SPI device driver interface uses "ioctl" call to control specific
* SPI functions during operation. For details see "ioctl" call.
*
******************************************************************************/

/******************************************************************************
* type of SPI characters and buffers (can be defined as "char" in appconfig.h) 
******************************************************************************/

#ifndef SPI0CHAR
#define SPI0CHAR UWord16    /* HawkV1 compatible 16bit characters by default */
#endif

#ifndef SPI1CHAR
#define SPI1CHAR UWord16    /* HawkV1 compatible 16bit characters by default */
#endif

/****************************************************
* Configurable items, i.e. defines, for appconfig.h
****************************************************

    #define INT_VECTOR_ADDR_yy isr_routine      // specify interrupt handler routine
    #define INT_PRIORITY_LEVEL_yy INTC_LEVEL1   // interrupt level : (INTC_DISABLED, INTC_LEVEL0,...INTC_LEVEL2)
  
    #define SPI_0_SPSCR_INIT  0         // SPI0 Status Control Reg (SPSCR)
    #define SPI_0_SPDSCR_INIT 0x000F    // SPI0 Data Size Reg (SPDSR) num=(num_bits-1) 

    dtto for SPI_1
 
  where:
         yy  is interrupt vector number
         
            e.g. on 56F8346:
                40 - SPI 0 Receiver Full
                41 - SPI 0 Transmitter Empty
                
                38 - SPI 1 Receiver Full
                39 - SPI 1 Transmitter Empty
                
                
  To enable NON_BLOCKING SPI_0 read & write functions, do:
  
    #define INT_VECTOR_ADDR_40 Spi0RxFullISR
    #define INT_VECTOR_ADDR_41 Spi0TxEmptyISR
    #define INT_PRIORITY_LEVEL_40 INTC_LEVEL1
    #define INT_PRIORITY_LEVEL_41 INTC_LEVEL1

  To install read & write hooks, define
  
    #define SPI_0_ERROR_HOOK         rx_error_hook      // all operations
    #define SPI_0_RX_CHAR_HOOK       rx_char_hook       // all operations
    #define SPI_0_TX_CHAR_HOOK       tx_char_hook       // all operations
    #define SPI_0_RX_FINISHED_HOOK   rx_finished_hook   // NON_BLOCKING operation only 
    #define SPI_0_TX_FINISHED_HOOK   tx_finished_hook   // NON_BLOCKING operation only 

  where:
  
    UWord16 rx_char_hook(UWord16 rxchar)  // is called for each character received (both bl/nobl), 
                                          // return nonzero to discard received character
                                          // return zero to accept received character
                                          // you can use SPI_READ_CANCEL command to abort operation
                                          
    void rx_finished_hook(void)           // called when non-blocking read finishes
    
    void error_hook(void)                 // called when error occures during read (both bl/nonbl)
                                          // read SPI_x->spisr to get status register
    
    UWord16 tx_char_hook(UWord16 txchar)  // called after each character transmitted (both bl/nonbl)
                                          // return nonzero to not to transmit next buffered character 
                                                (you have to write SPIDR yourself using SPI_WRITE_DATA)
                                          // return zero to continue with transmission
                                          // you can use SPI_WRITE_CANCEL command to abort operation
                                          
    void tx_finished_hook(void)           // called when non-blocking write finishes


