TESKAn/kontroler_V4/src/MC56F84763/peripheral/spi.h
  In any hook function, you can issue new (NON_BLOCKING) read or write operation. 
 
 */


/***************************************************
* SPI Ioctl commands
****************************************************/
/* command                    |        Param       */

/* SPI status and control register commands */
#define SPI_INIT                /* NULL, Initialization of the periheral registers using appconfig.h _INIT values */
#define SPI_DEVICE              /* SPI_ENABLE / SPI_DISABLE,  Enable/disable SPI device (QSPIx_SPSCR->SPE) */
#define SPI_SET_MODE            /* SPI_MASTER / SPI_SLAVE, Set SPI to MASTER or SLAVE mode.(QSPIx_SPSCR->SPMSTR) */
#define SPI_SET_ORDER           /* SPI_LSB_FIRST / SPI_MSB_FIRST, Select SPI data shift bit ordering - MSB bit first or LSB bit (QSPIx_SPSCR->DSO) */
#define SPI_SET_CLOCK_POLARITY  /* SPI_RISING_EDGE / SPI_FALLING_EDGE, Set SPI clock edge which shifts out data - either falling edge or rising edge  (QSPIx_SPSCR->CPOL) */
#define SPI_SET_CLOCK_PHASE     /* SPI_SCLK_EDGE / SPI_SS_EDGE,  Determine the condition which starts data shift out of SLAVE device. Transmission is started by first SCLK edge or falling edge on /SS pin (which edge starts slave transmission) (QSPIx_SPSCR->CPHA)  */
#define SPI_SET_MODE_FAULT      /* SPI_ENABLE / SPI_DISABLE,  Configure SPI device to use mode fault detection logic or to disable mode fault checking (ena/dis mode fault) (QSPIx_SPSCR->MODFEN)  */
#define SPI_SET_BAUD_DIV        /* SPI_DIVx(2/4/8/16/32/64/128/256), Set SPI baud rate (clock) divisor (QSPIx_SPSCR->SPR[2-0])  */

/* interrrupts enable disable */
#define SPI_RX_FULL_INT         /* SPI_ENABLE / SPI_DISABLE, Interrupt enable or disable for SPRIE (QSPIx_SPSCR->SPRIE)*/
#define SPI_TX_EMPTY_INT        /* SPI_ENABLE / SPI_DISABLE, Interrupt enable or disable for SPTIE (QSPIx_SPSCR->SPTIE)*/
#define SPI_ERROR_INT           /* SPI_ENABLE / SPI_DISABLE, Interrupt enable or disable for ERRIE (QSPIx_SPSCR->ERRIE)*/
#define SPI_INT_ENABLE          /* SPI_TX_EMPTY | SPI_RX_FULL | SPI_ERROR, Enable the selected SPI interrupts. (QSPIx_SPSCR->SPRIE,QSPIx_SPSCR->SPTIE,QSPIx_SPSCR->ERRIE) */
#define SPI_INT_DISABLE         /* SPI_TX_EMPTY | SPI_RX_FULL | SPI_ERROR, Disable the selected SPI interrupts.(QSPIx_SPSCR->SPRIE,QSPIx_SPSCR->SPTIE,QSPIx_SPSCR->ERRIE) */

/* SPI data and control register commands */
#define SPI_SET_TX_DATA_SIZE    /* data size (2..16), Set length of the data word in bits. Possible value is 2-16. (QSPIx_SPDSR->DS[3-0]) */
#define SPI_SET_WIRED_OR_MODE   /* SPI_NORMAL / SPI_OPEN_DRAIN, Set wired-or mode of the SPI pins. (QSPIx_SPDSR->WOM) */

/* data registers */
#define SPI_WRITE_DATA          /* UWord16, Write data to SPI Data Transmit Register. When in MASTER mode it initiates transmission. (QSPIx_SPDTR->_) */
#define SPI_READ_DATA           /* NULL, Read SPI Data Receive Register. It contains previously received data. (QSPIx_SPDTR->_) */

/* test SPI status bits - can be used directly in condition */
/* if it is used in assignement then it returns bit value in original bit position */
#define SPI_GET_TX_EMPTY        /* NULL, test SPTE bit (QSPIx_SPSCR->SPTE) */
#define SPI_GET_RX_FULL         /* NULL, test SPRF bit (QSPIx_SPSCR->SPRF) */
#define SPI_GET_RX_OVERFLOW     /* NULL, test OVRF bit (QSPIx_SPSCR->OVRF) */
#define SPI_GET_MODE_FAULT      /* NULL, test MODF bit (QSPIx_SPSCR->MODF) */

#define SPI_READ_CONTROL_REG    /* NULL, Read SPI Control Register. (QSPIx_SPSCR->_) */
#define SPI_WRITE_CONTROL_REG   /* UWord16, Write to SPI Control Register. (QSPIx_SPSCR->_) */

#define SPI_GET_ERROR           /* NULL, Test Status and Control Register OVRF and MODF bits (test if any SPI error) (QSPIx_SPSCR->MODF,OVRF) */
#define SPI_CLEAR_MODE_FAULT    /* NULL, Clear Status and Control Register MODF bit (“Mode Fault bit”). (QSPIx_SPSCR->MODF) */

/* commands for high-level operations (BLOCKING/NON_BLOCKING read, write) */
#define SPI_CLEAR_EXCEPTION     /* NULL, Clear read/write functions exception if exists */
#define SPI_GET_STATUS          /* NULL, Get read/write functions SPI operation status, returns UWord16 */
#define SPI_WRITE_CANCEL        /* NULL, Cancel non-blocking write operation (QSPIx_SPSCR->SPTIE) */
#define SPI_READ_CANCEL         /* NULL, Cancel non-blocking read operation (QSPIx_SPSCR->SPRIE) */

/****************************************************************************
* SPI Version 2 commands (802x3x)
*****************************************************************************/

#if SPI_VERSION >= 2
#define SPI_MULT_BAUD_DIV       /* SPI_MULT_DIV_1x / SPI_MULT_DIV_2x, multiply divisor value (QSPIx_SPDSR->BD2X) */
#define SPI_TEST_SS_INPUT       /* NULL, return immediate state of SS input pin (QSPIx_SPDSR->SSB_IN) */
#define SPI_SET_SS_MODE         /* one of SPI_SS_xxx (the two SPI_SS_AUTO_xxx may be combined), SetsSS signal mode during SPI-Master operation.(QSPIx_SPDSR->SSB_AUTO,SSB_DDR,SSB_STRB) */ 
#define SPI_SET_SS_OUTPUT       /* boolean, set SS pin value in SPI_SS_MANUAL_OUT mode (QSPIx_SPDSR->SSB_DATA) */ 
#define SPI_SET_SS_WIRED_OR_MODE /* SPI_OPEN_DRAIN/SPI_NORMAL, set SS pin mode (QSPIx_SPDSR->SSB_ODM) */ 
#define SPI_OVERRIDE_SS_INPUT   /* SPI_ENABLE / SPI_DISABLE, override internal SS input with value of SPMSTR bit (QSPIx_SPDSR->SSB_OVER) */ 
#endif /* SPI_VERSION >= 2 */

#if SPI_VERSION == 2 || SPI_VERSION >= 4
#define SPI_WRITE_DATA_DELAY    /* UWord16 (0..0x1fff), set inter-word delay in IPbus clocks (QSPIx_SPWAIT->_) */

#define SPI_QUEUED_MODE          /* SPI_ENABLE / SPI_DISABLE, enable SPI FIFOs (QSPIx_SPFIFO->FIFO_ENA) */
#define SPI_SET_TXEMPTY_CONDITION /* SPI_TXEMPTY_WHEN_xxx, or value 0..3 how many words in TX FIFO causes TXEMPTY condition (QSPIx_SPFIFO->TFWM) */
#define SPI_SET_RXFULL_CONDITION  /* SPI_RXFULL_WHEN_xxx, or value 0..3 how many words (plus 1) in RX FIFO causes RXFULL condition (QSPIx_SPFIFO->RFWM) */
#define SPI_CAN_READ_DATA       /* NULL, return non-zero if valid data are waiting in receive FIFO (QSPIx_SPFIFO->RFCNT) */
#define SPI_CAN_WRITE_DATA      /* NULL, return non-zero if free space in TX FIFO enables data write (QSPIx_SPFIFO->TFCNT) */
#endif /* SPI_VERSION == 2 || SPI_VERSION >= 4 */

/****************************************************************************
* SPI Version 5 commands (844x/5x/7x)
*****************************************************************************/
#if SPI_VERSION >= 5
#define SPI_DMA_TX              /* SPI_ENABLE / SPI_DISABLE, enable SPI TX DMA (QSPIx_SPDRR->TDMAEN)*/
#define SPI_DMA_RX              /* SPI_ENABLE / SPI_DISABLE, enable SPI RX DMA (QSPIx_SPDRR->TDMAEN)*/
#define SPI_STOP_MODE_HOLDOFF   /* SPI_ENABLE / SPI_DISABLE, enable Stop Mode Holdoff (QSPIx_SPCTL2->SHEN)*/
#endif /* SPI_VERSION >= 5 */

/****************************************************************************
* read/write modes of operation
*****************************************************************************/

#define BLOCKING      /* blocking mode for read/write functions */
#define NON_BLOCKING  /* non-blocking mode for read/write functions */

/****************************************************************************
* SPI constants and type declarations used in the ioctl functions
*****************************************************************************/

#define SPI_ENABLE        1
#define SPI_DISABLE       0

#define SPI_MASTER        1
#define SPI_SLAVE         0

#define SPI_MSB_FIRST     0
#define SPI_LSB_FIRST     1

#if SPI_VERSION <= 2
#define SPI_RISING_EDGE   1
#define SPI_FALLING_EDGE  0
#else /* SPI_VERSION >= 3 */
#define SPI_RISING_EDGE   0
#define SPI_FALLING_EDGE  1
#endif


