TESKAn/kontroler_V4/src/MC56F84763/peripheral/spi.h
#define SPI_SCLK_EDGE     1
#define SPI_SS_EDGE       0

#define SPI_OPEN_DRAIN    1
#define SPI_NORMAL        0

/* SPI_SET_BAUD_DIV */
#define SPI_DIV2        SPI_SPSCR_SPR_DIV2  
#define SPI_DIV4        SPI_SPSCR_SPR_DIV4  
#define SPI_DIV8        SPI_SPSCR_SPR_DIV8  
#define SPI_DIV16       SPI_SPSCR_SPR_DIV16 
#define SPI_DIV32       SPI_SPSCR_SPR_DIV32 
#define SPI_DIV64       SPI_SPSCR_SPR_DIV64 
#define SPI_DIV128      SPI_SPSCR_SPR_DIV128
#define SPI_DIV256      SPI_SPSCR_SPR_DIV256
#if SPI_VERSION >= 3
#define SPI_DIV512      (SPI_SPSCR_SPR_DIV2 | SPI_SPDSCR_SPR3)   
#define SPI_DIV1024     (SPI_SPSCR_SPR_DIV4 | SPI_SPDSCR_SPR3)
#define SPI_DIV2048     (SPI_SPSCR_SPR_DIV8  | SPI_SPDSCR_SPR3)
#define SPI_DIV4096     (SPI_SPSCR_SPR_DIV16  | SPI_SPDSCR_SPR3)
#endif

#if SPI_VERSION >= 4
#define SPI_DIV8192     (SPI_SPSCR_SPR_DIV32| SPI_SPDSCR_SPR3)
#define SPI_DIV16384    (SPI_SPSCR_SPR_DIV64 | SPI_SPDSCR_SPR3)
#endif


/* interrupts */
#define SPI_TX_EMPTY    SPI_SPSCR_SPTIE
#define SPI_RX_FULL     SPI_SPSCR_SPRIE
#define SPI_ERROR       SPI_SPSCR_ERRIE

#if SPI_VERSION >= 2

/* divisor multiplcation factor */
#define SPI_MULT_DIV_1x 0
#define SPI_MULT_DIV_2x 1

/* TXEMPTY condition */
#define SPI_TXEMPTY_WHEN_FIFO_EMPTY        0
#define SPI_TXEMPTY_WHEN_1_OR_LESS_IN_FIFO 1
#define SPI_TXEMPTY_WHEN_2_OR_LESS_IN_FIFO 2
#define SPI_TXEMPTY_WHEN_3_OR_LESS_IN_FIFO 3

/* RXFULL condition */
#define SPI_RXFULL_WHEN_1_OR_MORE_IN_FIFO  0
#define SPI_RXFULL_WHEN_2_OR_MORE_IN_FIFO  1
#define SPI_RXFULL_WHEN_3_OR_MORE_IN_FIFO  2
#define SPI_RXFULL_WHEN_4_OR_MORE_IN_FIFO  3

/* SS mode */
#define SPI_SS_INPUT            0
#define SPI_SS_MANUAL_OUT       SPI_SPDSCR_SS_DDR
#define SPI_SS_AUTO_ENVELOPE    (SPI_SPDSCR_SS_DDR | SPI_SPDSCR_SS_AUTO)
#define SPI_SS_AUTO_STROBE      (SPI_SPDSCR_SS_DDR | SPI_SPDSCR_SS_STRB)

/* SS manual out value */
#define SPI_HIGH 1
#define SPI_LOW  0

#endif /* SPI_VERSION >= 2 */

/* status generated by read/write functions -> check by SPI0_GET_STATUS command */

#define SPI_STATUS_WRITE_INPROGRESS     0x0001    /* write to SPI is in progress */
#define SPI_STATUS_READ_INPROGRESS      0x0002    /* read from SPI is in progress */
#define SPI_STATUS_EXCEPTION_EXIST      0x0010    /* exception exists - HW exception if only this flag is set
                                                           - SW exception if other exception flags are set */
#define SPI_EXCEPTION_BUFFER_OVERFLOW   0x0020    /* buffer overflow - some bytes were thrown away */
/* exception codes */
#define SPI_EXCEPTION_OVERRUN           0x0040
#define SPI_EXCEPTION_MODE_FAULT        0x0080

/*****************************************************************
* SPI Register Bits Defines, used in ioctl command implementation
******************************************************************/

/* SPI Status and Control Register (SPSCR) */
#define SPI_SPSCR_SPR_MASK      0xe000
#define SPI_SPSCR_SPR_DIV2      0x0000
#define SPI_SPSCR_SPR_DIV4      0x2000
#define SPI_SPSCR_SPR_DIV8      0x4000
#define SPI_SPSCR_SPR_DIV16     0x6000
#define SPI_SPSCR_SPR_DIV32     0x8000
#define SPI_SPSCR_SPR_DIV64     0xa000
#define SPI_SPSCR_SPR_DIV128    0xc000
#define SPI_SPSCR_SPR_DIV256    0xe000
#define SPI_SPSCR_DSO           0x1000
#define SPI_SPSCR_ERRIE         0x0800
#define SPI_SPSCR_MODFEN        0x0400
#define SPI_SPSCR_SPRIE         0x0200
#define SPI_SPSCR_SPMSTR        0x0100
#define SPI_SPSCR_CPOL          0x0080
#define SPI_SPSCR_CPHA          0x0040
#define SPI_SPSCR_SPE           0x0020
#define SPI_SPSCR_SPTIE         0x0010
#define SPI_SPSCR_SPRF          0x0008
#define SPI_SPSCR_OVRF          0x0004
#define SPI_SPSCR_MODF          0x0002
#define SPI_SPSCR_SPTE          0x0001

/* SPI DataSize and Control Register (SPDSCR) */
#define SPI_SPDSCR_WOM          0x8000
#define SPI_SPDSCR_TDMAEN       0x4000
#define SPI_SPDSCR_RDMAEN       0x2000
#define SPI_SPDSCR_DS_MASK      0x000f
#define SPI_SPDSCR_DS2          0x0001
#define SPI_SPDSCR_DS3          0x0002
#define SPI_SPDSCR_DS4          0x0003
#define SPI_SPDSCR_DS5          0x0004
#define SPI_SPDSCR_DS6          0x0005
#define SPI_SPDSCR_DS7          0x0006
#define SPI_SPDSCR_DS8          0x0007
#define SPI_SPDSCR_DS9          0x0008
#define SPI_SPDSCR_DS10         0x0009
#define SPI_SPDSCR_DS11         0x000a
#define SPI_SPDSCR_DS12         0x000b
#define SPI_SPDSCR_DS13         0x000c
#define SPI_SPDSCR_DS14         0x000d
#define SPI_SPDSCR_DS15         0x000e
#define SPI_SPDSCR_DS16         0x000f

#if SPI_VERSION >= 2
#define SPI_SPDSCR_BD2x         0x1000
#define SPI_SPDSCR_SS_IN        0x0800
#define SPI_SPDSCR_SS_DATA      0x0400
#define SPI_SPDSCR_SS_ODM       0x0200
#define SPI_SPDSCR_SS_AUTO      0x0100
#define SPI_SPDSCR_SS_DDR       0x0080
#define SPI_SPDSCR_SS_STRB      0x0040
#define SPI_SPDSCR_SS_OVER      0x0020
#endif

#if SPI_VERSION >= 3
#define SPI_SPDSCR_SPR3         0x0010
#endif

#if SPI_VERSION >= 5
#define SPI_SPDSR_TDMAEN     0x4000
#define SPI_SPDSR_RDMAEN     0x2000
#endif

/* FIFO control register */
#if SPI_VERSION >= 2
#define SPI_FIFO_TFCNT_MASK     0x7000
#define SPI_FIFO_TFCNT_FULL     0x4000
#define SPI_FIFO_RFCNT_MASK     0x0700
#define SPI_FIFO_RFCNT_FULL     0x0400
#define SPI_FIFO_TFWM_MASK      0x0060
#define SPI_FIFO_RFWM_MASK      0x000c
#define SPI_FIFO_FIFO_ENA       0x0001
#endif

/* Delay Register */
#if SPI_VERSION >= 2
#define SPI_DELAY_WAIT_MASK     0x1fff
#endif

/* Control Register 2 */
#if SPI_VERSION >= 5
#define SPI_SPCTL2_SHEN     	0x0001
#endif
/*******************************************************************************
    Bit names of older SDK version, maintained here for backward compatibility.
*******************************************************************************/

/* Do not use for new development ! */
#define SPI_SPE     SPI_SPSCR_SPE
#define SPI_SPTIE   SPI_SPSCR_SPTIE
#define SPI_CPHA    SPI_SPSCR_CPHA
#define SPI_CPOL    SPI_SPSCR_CPOL
#define SPI_SPMSTR  SPI_SPSCR_SPMSTR
#define SPI_SPRIE   SPI_SPSCR_SPRIE
#define SPI_MODFEN  SPI_SPSCR_MODFEN
#define SPI_ERRIE   SPI_SPSCR_ERRIE
#define SPI_DSO     SPI_SPSCR_DSO
#define SPI_SPTE    SPI_SPSCR_SPTE
#define SPI_MODF    SPI_SPSCR_MODF
#define SPI_OVRF    SPI_SPSCR_OVRF
#define SPI_SPRF    SPI_SPSCR_SPRF


/****************************************************************************
* SPI function prototypes
*****************************************************************************/

void spiInit(arch_sSPI *pSpiBase);

