TESKAn/kontroler_V4/src/MC56F84763/peripheral/spi.h
void Spi0TxEmptyISR(void);
void Spi0RxFullISR(void);
void write_SPI_0_NON_BLOCKING(const SPI0CHAR *buf, UWord16 size);
void read_SPI_0_NON_BLOCKING(SPI0CHAR *buf, UWord16 size);
void write_SPI_0_BLOCKING(const SPI0CHAR *buf, UWord16 size);
void read_SPI_0_BLOCKING(SPI0CHAR *buf, UWord16 size);

void Spi1TxEmptyISR(void);
void Spi1RxFullISR(void);
void write_SPI_1_NON_BLOCKING(const SPI1CHAR *buf, UWord16 size);
void read_SPI_1_NON_BLOCKING(SPI1CHAR *buf, UWord16 size);
void write_SPI_1_BLOCKING(const SPI1CHAR *buf, UWord16 size);
void read_SPI_1_BLOCKING(SPI1CHAR *buf, UWord16 size);

/***********************************************************************
* hook prototypes - we define prototypes ourselves - to assure proper 
*                   return and argument types
***********************************************************************/

#ifdef SPI_0_RX_CHAR_HOOK
UWord16 SPI_0_RX_CHAR_HOOK(UWord16);
#endif
#ifdef SPI_0_RX_FINISHED_HOOK
void SPI_0_RX_FINISHED_HOOK(void);
#endif
#ifdef SPI_0_ERROR_HOOK
void SPI_0_ERROR_HOOK(void);
#endif
#ifdef SPI_0_TX_CHAR_HOOK
UWord16 SPI_0_TX_CHAR_HOOK(UWord16);
#endif
#ifdef SPI_0_TX_FINISHED_HOOK
void SPI_0_TX_FINISHED_HOOK(void);
#endif

#ifdef SPI_1_RX_CHAR_HOOK
UWord16 SPI_1_RX_CHAR_HOOK(UWord16);
#endif
#ifdef SPI_1_RX_FINISHED_HOOK
void SPI_1_RX_FINISHED_HOOK(void);
#endif
#ifdef SPI_1_ERROR_HOOK
void SPI_1_ERROR_HOOK(void);
#endif
#ifdef SPI_1_TX_CHAR_HOOK
UWord16 SPI_1_TX_CHAR_HOOK(UWord16);
#endif
#ifdef SPI_1_TX_FINISHED_HOOK
void SPI_1_TX_FINISHED_HOOK(void);
#endif

/***********************************************************************
* SPI is a module name alias to SPI_0 (on some devices)
***********************************************************************/

#ifdef SPI
    #define read_SPI_NON_BLOCKING  read_SPI_0_NON_BLOCKING
    #define read_SPI_BLOCKING      read_SPI_0_BLOCKING
    #define write_SPI_NON_BLOCKING write_SPI_0_NON_BLOCKING
    #define write_SPI_BLOCKING     write_SPI_0_BLOCKING
#endif

/***********************************************************************
* status variables for read/wrire functions
***********************************************************************/

extern volatile UWord16 spi0_status;
extern volatile UWord16 spi0_RxCounter;
extern volatile UWord16 spi0_TxCounter;

extern volatile UWord16 spi1_status;
extern volatile UWord16 spi1_RxCounter;
extern volatile UWord16 spi1_TxCounter;

/***********************************************************************
* ioctl implementation
***********************************************************************/

/* module names for internal use in ioctl implementation */

#define __SPI_0 SPI_0

#ifdef SPI_1
#define __SPI_1 SPI_1
#else
#define __SPI_1 ((arch_sSPI*)NULL)
#endif
 
/***********************************************************************
* SPI init
***********************************************************************/

#define ioctlSPI_INIT(pSpiBase, param) spiInit(pSpiBase)

/***********************************************************************
* SPI control command macros
***********************************************************************/

/* SPI peripheral enable/disable */
#define ioctlSPI_DEVICE(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_SPE, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_SPE, &((pSpiBase)->spscr))

/* SPI MASTER/SLAVE mode set */
#define ioctlSPI_SET_MODE(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_SPMSTR, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_SPMSTR, &((pSpiBase)->spscr))

/* SPI data shift order set */
#define ioctlSPI_SET_ORDER(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_DSO, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_DSO, &((pSpiBase)->spscr))
 
/* SPI clock polarity set */
#define ioctlSPI_SET_CLOCK_POLARITY(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_CPOL, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_CPOL, &((pSpiBase)->spscr))

/* SPI clock phase set */
#define ioctlSPI_SET_CLOCK_PHASE(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_CPHA, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_CPHA, &((pSpiBase)->spscr))

/* SPI mode fault detect set */
#define ioctlSPI_SET_MODE_FAULT(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_MODFEN, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_MODFEN, &((pSpiBase)->spscr))

/* SPI receive interrupt enable/disable */
#define ioctlSPI_RX_FULL_INT(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_SPRIE, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_SPRIE, &((pSpiBase)->spscr))

/* SPI transmit interrupt enable/disable */
#define ioctlSPI_TX_EMPTY_INT(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_SPTIE, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_SPTIE, &((pSpiBase)->spscr))

/* SPI transmit interrupt enable/disable */
#define ioctlSPI_ERROR_INT(pSpiBase, param) \
  if (param) periphBitSet(SPI_SPSCR_ERRIE, &((pSpiBase)->spscr)); \
  else periphBitClear(SPI_SPSCR_ERRIE, &((pSpiBase)->spscr))

#define ioctlSPI_INT_ENABLE(pSpiBase, param)        \
  periphBitSet (param, &((pSpiBase)->spscr))

#define ioctlSPI_INT_DISABLE(pSpiBase, param)       \
  periphBitClear (param, &((pSpiBase)->spscr))
  
/* set SPI baud divisor */
#if SPI_VERSION <= 2
#define ioctlSPI_SET_BAUD_DIV(pSpiBase, param) \
  periphBitGrpRS(SPI_SPSCR_SPR_MASK, param, &((pSpiBase)->spscr))
#else /* SPI_VERSION >= 3 */
 #define ioctlSPI_SET_BAUD_DIV(pSpiBase, param) \
  {periphBitGrpRS(SPI_SPSCR_SPR_MASK, param, &((pSpiBase)->spscr)); \
  periphBitGrpRS(SPI_SPDSCR_SPR3, param, &((pSpiBase)->spdsr));}
#endif /* SPI_VERSION >= 3 */

/* set data size */
#define ioctlSPI_SET_TX_DATA_SIZE(pSpiBase, param) \
  periphBitGrpSR(SPI_SPDSCR_DS_MASK, (param)-1, &((pSpiBase)->spdsr))
  
/* set wired-or mode */
#define ioctlSPI_SET_WIRED_OR_MODE(pSpiBase, param) \
  { if (param) periphBitSet(SPI_SPDSCR_WOM, &((pSpiBase)->spdsr)); \
    else periphBitClear(SPI_SPDSCR_WOM, &((pSpiBase)->spdsr)); }

