TESKAn/kontroler_V4/src/MC56F84763/peripheral/spi.h
/* read SPI cpntrol register */
#define ioctlSPI_READ_CONTROL_REG(pSpiBase, param) \
  periphMemRead(&((pSpiBase)->spscr))

/* write SPI cpntrol register */
#define ioctlSPI_WRITE_CONTROL_REG(pSpiBase, param) \
  periphMemWrite(param, &((pSpiBase)->spscr))

/* write SPI Tx register */
#define ioctlSPI_WRITE_DATA(pSpiBase, param) \
  periphMemWrite(param, &((pSpiBase)->spdtr))
  
/* reads SPI Rx register */
#define ioctlSPI_READ_DATA(pSpiBase, param) \
  periphMemForcedRead(&((pSpiBase)->spdrr))

/* test SPI Tx reg. empty bit */
#define ioctlSPI_GET_TX_EMPTY(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_SPTE, &((pSpiBase)->spscr))

/* test SPI Rx reg. full bit */
#define ioctlSPI_GET_RX_FULL(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_SPRF, &((pSpiBase)->spscr))

/* test SPI overflow bit */
#define ioctlSPI_GET_RX_OVERFLOW(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_OVRF, &((pSpiBase)->spscr))
  
/* test SPI mode fault occurence bit */
#define ioctlSPI_GET_MODE_FAULT(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_MODF, &((pSpiBase)->spscr))

/* test SPI two error bits */
#define ioctlSPI_GET_ERROR(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_MODF | SPI_SPSCR_OVRF, &((pSpiBase)->spscr))

/* clear SPI mode fault occurence bit - cleared by writing "1" to MODF */
/* note: it is the only clear-by-write-one bit in SPSCR, we don't need to use periphSafeAckByOne() */
#define ioctlSPI_CLEAR_MODE_FAULT(pSpiBase, param) \
  periphBitSet(SPI_SPSCR_MODF, &((pSpiBase)->spscr))

#if SPI_VERSION >= 2
/* multiply divisor value 2x */
#define ioctlSPI_MULT_BAUD_DIV(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSCR_BD2x, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSCR_BD2x, &((pSpiBase)->spdsr))

/* return immediate state of SS input pin */
#define ioctlSPI_TEST_SS_INPUT(pSpiBase, param)    \
  periphBitTest(SPI_SPDSCR_SS_IN, &((pSpiBase)->spdsr))

/* set SS pin function */ 
#define ioctlSPI_SET_SS_MODE(pSpiBase, param)    \
  periphBitGrpSet(SPI_SPDSCR_SS_AUTO | SPI_SPDSCR_SS_DDR | SPI_SPDSCR_SS_STRB, param, &((pSpiBase)->spdsr))

/* sets SS pin value in SPI_SS_MANUAL_OUT mode */ 
#define ioctlSPI_SET_SS_OUTPUT(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSCR_SS_DATA, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSCR_SS_DATA, &((pSpiBase)->spdsr))

/* set SS pin mode */ 
#define ioctlSPI_SET_SS_WIRED_OR_MODE(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSCR_SS_ODM, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSCR_SS_ODM, &((pSpiBase)->spdsr))

/* override internal SS input*/
#define ioctlSPI_OVERRIDE_SS_INPUT(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSCR_SS_OVER, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSCR_SS_OVER, &((pSpiBase)->spdsr))
#endif /* SPI_VERSION >= 2 */


#if SPI_VERSION == 2 || SPI_VERSION >= 4
/* write inter-word delay */
#define ioctlSPI_WRITE_DATA_DELAY(pSpiBase, param)    \
  periphMemWrite(param, &((pSpiBase)->delay))

/* enable SPI FIFOs */
#define ioctlSPI_QUEUED_MODE(pSpiBase, param)    \
  if (param) periphBitSet(SPI_FIFO_FIFO_ENA, &((pSpiBase)->fifo)); \
  else periphBitClear(SPI_FIFO_FIFO_ENA, &((pSpiBase)->fifo))
  
/* set how many words in TX FIFO causes TXEMPTY condition */  
#define ioctlSPI_SET_TXEMPTY_CONDITION(pSpiBase, param)    \
  periphBitGrpSet(SPI_FIFO_TFWM_MASK, (param) << 5, &((pSpiBase)->fifo))

/* set how many words (plus 1) in RX FIFO causes RXFULL condition */  
#define ioctlSPI_SET_RXFULL_CONDITION(pSpiBase, param)    \
  periphBitGrpSet(SPI_FIFO_RFWM_MASK, (param) << 2, &((pSpiBase)->fifo))

/* returns non-zero if valid data are waiting in receive FIFO */
#define ioctlSPI_CAN_READ_DATA(pSpiBase, param)    \
  (periphMemRead(&((pSpiBase)->fifo)) & SPI_FIFO_RFCNT_MASK)

/* returns non-zero if free space in TX FIFO enables data write */
#define ioctlSPI_CAN_WRITE_DATA(pSpiBase, param)    \
  (!(periphMemRead(&((pSpiBase)->fifo)) & SPI_FIFO_TFCNT_FULL))

#endif /* SPI_VERSION == 2 || SPI_VERSION >= 4 */

#if SPI_VERSION >= 5

/* enable SPI TX DMA */
#define ioctlSPI_DMA_TX(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSR_TDMAEN, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSR_TDMAEN, &((pSpiBase)->spdsr))

/* enable SPI RX DMA */
#define ioctlSPI_DMA_RX(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPDSR_RDMAEN, &((pSpiBase)->spdsr)); \
  else periphBitClear(SPI_SPDSR_RDMAEN, &((pSpiBase)->spdsr))

/* enable Stop Mode Holdoff */
#define ioctlSPI_STOP_MODE_HOLDOFF(pSpiBase, param)    \
  if (param) periphBitSet(SPI_SPCTL2_SHEN, &((pSpiBase)->spctl2)); \
  else periphBitClear(SPI_SPCTL2_SHEN, &((pSpiBase)->spctl2))

#endif

/***********************************************************************
* End-of-life commands (maintained for backward compatibility only)
***********************************************************************/

#define ioctlSPI_WRITE(pSpiBase, param) \
  periphMemWrite(param, &((pSpiBase)->spdtr))

#define ioctlSPI_READ(pSpiBase, param) \
  periphMemRead(&((pSpiBase)->spdrr))

#define ioctlSPI_ERROR_IS_OVERFLOW(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_OVRF, &((pSpiBase)->spscr))

#define ioctlSPI_ERROR_IS_MODEFAULT(pSpiBase, param) \
  periphBitTest(SPI_SPSCR_MODF, &((pSpiBase)->spscr))

#define ioctlSPI_SET_DATA_SIZE(pSpiBase, param) \
  periphBitGrpSR(SPI_SPDSCR_DS_MASK, (param)-1, &((pSpiBase)->spdsr))

#define ioctlSPI_INT_SELECT(pSpiBase, param)        \
  periphBitGrpRS (SPI_SPSCR_SPTIE | SPI_SPSCR_SPRIE | SPI_SPSCR_ERRIE, param, &((pSpiBase)->spscr))


/***********************************************************************
* High level driver commands
***********************************************************************/

/* clear status */
#define ioctlSPI_CLEAR_EXCEPTION(pSpiBase, param)  \
  periphBitClear(SPI_STATUS_EXCEPTION_EXIST | SPI_EXCEPTION_BUFFER_OVERFLOW |\
          SPI_EXCEPTION_OVERRUN | SPI_EXCEPTION_MODE_FAULT, &spi0_status)

/* get status */
#define ioctlSPI_GET_STATUS(pSpiBase, param)  \
  (((pSpiBase) == __SPI_0) ? periphMemRead(&spi0_status) :   \
  (((pSpiBase) == __SPI_1) ? periphMemRead(&spi1_status) : 0 ))

/* cancel SPI write operation */
#define ioctlSPI_WRITE_CANCEL(pSpiBase, param)  \
  if ((pSpiBase) == __SPI_0) { \
    periphBitClear(SPI_SPSCR_SPTIE, (UWord16 *) &__SPI_0->spscr); \
    periphMemWrite(0x0000, &spi0_TxCounter); \
    periphBitClear(SPI_STATUS_WRITE_INPROGRESS, &spi0_status); \
  } else if((pSpiBase) == __SPI_1) { \
    periphBitClear(SPI_SPSCR_SPTIE, (UWord16 *) &__SPI_1->spscr); \
    periphMemWrite(0x0000, &spi1_TxCounter); \
    periphBitClear(SPI_STATUS_WRITE_INPROGRESS, &spi1_status); \
  }
    
/* cancel SPI read operation */
#define ioctlSPI_READ_CANCEL(pSpiBase, param)  \
  if ((pSpiBase) == __SPI_0) { \
    periphBitClear(SPI_SPSCR_SPRIE, (UWord16 *) &__SPI_0->spscr); \
    periphMemWrite(0x0000, &spi0_RxCounter); \
    periphBitClear(SPI_STATUS_READ_INPROGRESS, &spi0_status); \
  } else if((pSpiBase) == __SPI_1) { \
    periphBitClear(SPI_SPSCR_SPRIE, (UWord16 *) &__SPI_1->spscr); \
    periphMemWrite(0x0000, &spi1_RxCounter); \
    periphBitClear(SPI_STATUS_READ_INPROGRESS, &spi1_status); \
  }

#ifdef __cplusplus
}
#endif

#endif
